# Некоторые из вас, наверно, знают, что ежегодно проводится чемпионат мира по программированию
# среди студентов (http://acm.baylor.edu). В финал этого соревнования проходят около 80 команд со всего мира.
#
# Каждая команда состоит из трех человек и имеет название. Напишите программу, которая по краткому названию
# команды и фамилиям ее участников, строит полное название команды.
#
# Полное название команды состоит из краткого названия команды и списка фамилий ее участников. Фамилии участников
# в списке должны быть упорядочены по алфавиту и отделены друг от друга запятыми. Название команды от фамилий
# участников должно быть отделено двоеточием. После каждого знака препинания должен стоять ровно один пробел.

team = input()
surname_1 = input()
surname_2 = input()
surname_3 = input()
list_surname = [surname_1, surname_2, surname_3]
list_surname.sort()
print(f'{team}: ', end='')
for i in range(len(list_surname) - 1):
    print(f'{list_surname[i]}, ', end='')
print(f'{list_surname[len(list_surname) - 1]}')
